/* 签名常量 */
export const signConstant = [
    '人声鼎沸怅，寂寥无人嗅。弱冠铭难忘，镜湖难泛舟。',
    '少年不识愁滋味，爱上层楼。爱上层楼，为赋新词强说愁。',
    '抽刀断水水更流，举杯销愁愁更愁。',
    '最是人间留不住，朱颜辞镜花辞树。',
    '君埋泉下泥销骨，我寄人间雪满头。',
    '赠你一绸星河 错落人间烟火',
    '遇见你那天，樱花开满南山。',
    '终有弱水替沧海，再无相思寄巫山。',
    '太阳可维修，月亮可更换，星星不好包退换。',
    '火车飞驰去往远方，两边黄灿灿的庄稼徐徐退后，我离家一百里又一百里。',
    '小舟从此逝，江海寄馀生。',
    '人间百年，忽如一梦。',
    '岁月涌入人潮 而我只敢问今朝。',
    '明天会有好天气和好运气。',
    '人们拒绝了这种悲哀，向天空举起彩色的盾牌。',
    '一杯杰克·威尔斯，我请。',
    '不要走进那温顺的良夜。',
    '三月的最后一天，我最喜欢的月份即将过去了，希望明年三月我带你们去看城南花开！城南花已开，花开花落时！',
    '是继续走下去，还是停止在现在？',
    '对花对酒，落梅成愁。十里长亭水悠悠。',
    '揽月入怀，醉酒溺江，骑鲸化仙。',
    '我与春风皆过客，她携秋月揽星河。',
    '噩梦并不受逻辑的控制，而且如果噩梦能够解释，反会失去原有的趣味，因为噩梦和恐惧的艺术是相互对立的。',
    '谁都不希望原地踏步，困在过去。他们想要改变，他们，还有这个世界。可改变个屁，“全新的交互方式，全新的高果糖糖浆，还带不同的水果口味"',
    '老实说，蟑螂披萨的味道还挺香的。呃，我是指，你们有钱人从来没吃过的那种。',
    '夜之城没有活着的传奇！',
    '我们的征途是星辰大海！',
    '那不朽的并非逝者，亘古中连死亡也会湮灭。',
    '有朝一日，利剑出鞘，锋芒毕露。',
    '世界属于三体！',
    '无名小卒，还是名扬天下？',
    '致命错误......',
    'mofeng说:来丶二次元。'
]

export function randomRange(lowerValue,upperValue):number{
    let total=upperValue-lowerValue+1
    return Math.floor(Math.random()*total+lowerValue)
}

export function randomSign():string{
    let length = signConstant.length
    let index = randomRange(0,length-1)
    if (index < 0) index = 0
    if(index >= signConstant.length) index = signConstant.length -1
    return signConstant[index]
}